// defines.h                           

#if !defined DEFINES_H
#define      DEFINES_H         


//*****************************************************************************

#define DEVICE_ID								  2501			// Концентратор связи КС3

#define DEFAULT_SERIAL_NUMBER		250100			// с/н

#define DEFAULT_MAC_HI			0x00000060UL		// default MAC адрес
#define DEFAULT_MAC_LO			0x37120000UL     


//*****************************************************************************

// TIMING 
#define TICK_US						 1000UL				// tick period, us
#define CLCK_T						 1000UL				// ticks per second
#define MS_TO_TICKS(ms)		((unsigned long)(ms))
#define TICKS_TO_MS(t)		(t)				

#define putlog(s) { putdw(TICKS_TO_MS(now)); puts(s); }


//-----------------------------------------------------------------------------
//                           Настройки UART
//-----------------------------------------------------------------------------

#define RS485_1_BAUD	  	115200UL			// RS485-1 (X4/X5) ISO
#define RS485_2_BAUD	  	115200				// RS485-2 (X6)
#define RS232_BAUD	  		115200				// RS232   (X3)

#define UART3_BAUD		  	RS232_BAUD	
#define UART1_BAUD		  	RS485_1_BAUD

#define UART1_TX_SIZE		 		 256				// RS485 down link
#define UART1_RX_SIZE		    2048
#define UART3_TX_SIZE		     256				// RS232 console
#define UART3_RX_SIZE		      64


//-----------------------------------------------------------------------------
//                          Настройки периферии
//-----------------------------------------------------------------------------


//-----------------------------------------------------------------------------
//                              Система
//-----------------------------------------------------------------------------

#define WDT_TIMEOUT									2  			// таймаут WDT, секунд

#define MESSAGE_QUEUE_SIZE				 32				// размер буфера сообщений между задачами


//-----------------------------------------------------------------------------
//                       Сохраняемые параметры
//-----------------------------------------------------------------------------

#define NUM_NV_BLOCKS				3		// число блоков параметров

// Идентификаторы блоков - см. TSetup1 .. TSetup3
#define NV_ID_SETUP1				1
#define NV_ID_SETUP2				2
#define NV_ID_SETUP3				3


//-----------------------------------------------------------------------------
//       Настройки процесса измерения, передачи и буферизации данных
//-----------------------------------------------------------------------------

// Интерфейс связи #1 - RS485-1
#define LINK1_SLAVES_N					 	8					// макс. число ведомых устройств

#define DATA_BUFFERS_N 						32 				// количество буферов данных

// Минимальное количество свободных буферов, при котором разрешается посылка
// внеочередного запроса данных в БИ
#define DATA_BUFFERS_FREE_TO_RQ  	3

#define DATA_SEND_RQ_PERIOD				250				// период отправки запросов на получение блоков данных

#define DATA_FULL_LIMIT_TO_RQ			60				// количество заполненных буферов в AI4R, свыше которого выполняется
																						// запрос занных от AI4R при полном заполнении выходного FIFO АЦП1																						


//-----------------------------------------------------------------------------
//                Обмен с ВУ и ведомыми устройствами
//-----------------------------------------------------------------------------

//
// Идентификаторы каналов связи - передаются в соотв. объекты TProtocolInstance.
// Для каналов, использующих UART, соответствуют номерам UART - см. реализацию
// TLayer1TxInterface
//
#define LINK_ID_HI_IO									9			// связь с ВУ по UDP
#define LINK_ID_LOCAL									1			// RS485-1

#define DEFAULT_NET_ADDRESS_HI_IO    	99
#define DEFAULT_NET_ADDRESS_LINK1			1
#define DEFAULT_NET_ADDRESS_LINK2			1

#define PROTOCOL_BROADCAST_ADDRESS	0xFF		// broadcast address
#define PROTOCOL_RX_TIMEOUT					5		  	// таймаут приема данных, миллисекунд


// Макс. размер прикладных данных в выходном пакете для разных вариантов
#define MAX_TX_APP_SIZE_DATAIO				(TProtocol::MaxPacketPayload)			// RS485
#define MAX_TX_APP_SIZE_DATAIO_APP		1472															// UDP


//-----------------------------------------------------------------------------
//   Номера регистров, коды и коэффициенты для опроса внешних устройств
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
//                        Управление устройством
//-----------------------------------------------------------------------------

// Маска для кода разрешения операции "Запись в регистр".
// Используется для записи в регистры, default недоступные для записи.
// В R14 записывается значение (R14_MASK_WR_REG | RegNumber), где RegNumber - номер регистра.
#define R14_MASK_WR_REG             0x1017'0000

// Маска кодов критических операций, записываемых в R19.
// При записи в R19 значения с установленными разрядами, попадающими под маску,
// проверяется разрешение записи в R14 - значение (R14_MASK_WR_REG | 19).
#define R19_MASK_PROTECTED_OP       0xFFFF'0000

// Разряды в R19 для управления отдельными режимами
#define R19_SIMULATE_DATA           0x0000'0002       // имитация данных измерения
#define R19_RS485_CONSOLE           0x1000'0000       // консоль через RS485


//-----------------------------------------------------------------------------
//                   Прием данных от блоков измерения
//-----------------------------------------------------------------------------

// Настройки опроса и обработки данных от блоков измерения находятся в cfg/slave_io.h

//-----------------------------------------------------------------------------
#endif	//      __DEFINES_H
